In [297]:
import pandas as pd
import unicodedata
t5 = pd.read_csv("aborto_metodo.csv", sep=";")#OK3
t6 = pd.read_csv("aborto_edad.csv", sep=";")#OK3
t7 = pd.read_csv("aborto_motivo.csv", sep=";")#OK3
t8 = pd.read_csv("aborto_gestacion.csv", sep=";")#OK3

Funciones:

In [298]:
def limpiar_concepto_abortos(df):
    reemplazos = {
        'Abortos voluntarios de mujeres residentes entre ': '',
        'Abortos voluntarios de mujeres residentes de ': '',
        'Abortos voluntarios de mujeres residentes ': ''
    }
    
    for buscar, nuevo in reemplazos.items():
        df["Concepto"] = df["Concepto"].str.replace(buscar, nuevo, regex=False)
    
    df["Concepto"] = df["Concepto"].str.strip()
    return df

In [299]:
def limpiar_columnas(df):
    columnas_a_eliminar = [
        "Tipo territorio",
        "Código territorio",
        "Territorio",
        "Unidad",
        "Estado dato"
    ]
    
    df = df.drop(columns=columnas_a_eliminar, errors="ignore")
    return df

In [300]:
def quitar_acentos(texto):
    if isinstance(texto, str):
        return ''.join(c for c in unicodedata.normalize('NFKD', texto) if not unicodedata.combining(c))
    return texto

In [301]:
def renombrar_columna(df, vieja, nueva):
    df = df.rename(columns={vieja: nueva})
    return df

Limpiar dataset t5

In [302]:
t5.head(3)

,Año,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,2011,Abortos voluntarios de mujeres residentes real...,Otros,NaN,NaN,3728,Número,NaN
1,2011,Abortos voluntarios de mujeres residentes real...,Otros,NaN,NaN,424,Número,NaN
2,2011,Abortos voluntarios de mujeres residentes real...,Otros,NaN,NaN,16231,Número,NaN

In [303]:
t5 = renombrar_columna(t5, "Año", "Anyo")
t5.head()

,Anyo,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,2011,Abortos voluntarios de mujeres residentes real...,Otros,NaN,NaN,3728,Número,NaN
1,2011,Abortos voluntarios de mujeres residentes real...,Otros,NaN,NaN,424,Número,NaN
2,2011,Abortos voluntarios de mujeres residentes real...,Otros,NaN,NaN,16231,Número,NaN
3,2011,Abortos voluntarios de mujeres residentes real...,Otros,NaN,NaN,304,Número,NaN
4,2011,Abortos voluntarios de mujeres residentes real...,Otros,NaN,NaN,76,Número,NaN

In [304]:
t5 = limpiar_columnas(t5)
t5.head()

   Anyo                                           Concepto  Valor
0  2011  Abortos voluntarios de mujeres residentes real...   3728
1  2011  Abortos voluntarios de mujeres residentes real...    424
2  2011  Abortos voluntarios de mujeres residentes real...  16231
3  2011  Abortos voluntarios de mujeres residentes real...    304
4  2011  Abortos voluntarios de mujeres residentes real...     76

In [305]:
t5["Concepto"].unique()

array(['Abortos voluntarios de mujeres residentes realizados por el método de dilatación y evacuación',
       'Abortos voluntarios de mujeres residentes realizados por el método de mifepristona',
       'Abortos voluntarios de mujeres residentes realizados por el método de dilatación y aspiración',
       'Abortos voluntarios de mujeres residentes realizados por el método de prostaglandinas',
       'Abortos voluntarios de mujeres residentes realizados por otros métodos / no consta'],
      dtype=object)

In [306]:
t5 = limpiar_concepto_abortos(t5)
t5.tail()

    Anyo                                           Concepto  Valor
65  2024        realizados por el método de prostaglandinas    357
66  2024           realizados por el método de mifepristona    790
67  2024  realizados por el método de dilatación y evacu...   4480
68  2024  realizados por el método de dilatación y aspir...  12605
69  2024           realizados por otros métodos / no consta     10

In [307]:
t5["Concepto"] = (t5['Concepto']
.str.replace('Abortos voluntarios de mujeres residentes realizados por el metodo de ', '', regex=False)
#.str.replace('Abortos voluntarios de mujeres residentes realizados por ', '', regex=False)
.str.replace(' / ', ' ', regex=False)
.str.strip()
)
t5.head()

   Anyo                                           Concepto  Valor
0  2011  realizados por el método de dilatación y evacu...   3728
1  2011           realizados por el método de mifepristona    424
2  2011  realizados por el método de dilatación y aspir...  16231
3  2011        realizados por el método de prostaglandinas    304
4  2011             realizados por otros métodos no consta     76

In [308]:
t5['Concepto'] = t5['Concepto'].apply(quitar_acentos)
t5.head()

   Anyo                                           Concepto  Valor
0  2011  realizados por el metodo de dilatacion y evacu...   3728
1  2011           realizados por el metodo de mifepristona    424
2  2011  realizados por el metodo de dilatacion y aspir...  16231
3  2011        realizados por el metodo de prostaglandinas    304
4  2011             realizados por otros metodos no consta     76

dataset T6

In [309]:
t6.head(3)

,Año,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,-,Número,NaN
1,1986,Abortos voluntarios de mujeres residentes de 4...,Otros,NaN,NaN,-,Número,NaN
2,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,-,Número,NaN

In [310]:
t6 = renombrar_columna(t6, "Año", "Anyo")
t6.head()

,Anyo,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,-,Número,NaN
1,1986,Abortos voluntarios de mujeres residentes de 4...,Otros,NaN,NaN,-,Número,NaN
2,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,-,Número,NaN
3,1986,Abortos voluntarios de mujeres residentes meno...,Otros,NaN,NaN,-,Número,NaN
4,1986,Total abortos voluntarios de mujeres residentes,Otros,NaN,NaN,148,Número,NaN

In [311]:
t6 = limpiar_concepto_abortos(t6)
t6.head()

,Anyo,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,1986,20 y 24años,Otros,NaN,NaN,-,Número,NaN
1,1986,44 años y más,Otros,NaN,NaN,-,Número,NaN
2,1986,40 y 44 años,Otros,NaN,NaN,-,Número,NaN
3,1986,menores de 15 años,Otros,NaN,NaN,-,Número,NaN
4,1986,Total abortos voluntarios de mujeres residentes,Otros,NaN,NaN,148,Número,NaN

In [312]:
t6['Concepto'] = t6['Concepto'].apply(quitar_acentos)

In [313]:
t6["Concepto"].unique()

array(['20 y 24anos', '44 anos y mas', '40 y 44 anos',
       'menores de 15 anos',
       'Total abortos voluntarios de mujeres residentes', '30 y 34 anos',
       '25 y 29 anos', '35 y 39 anos', '15 y 19 anos'], dtype=object)

In [314]:
t6 = limpiar_concepto_abortos(t6)
t6.tail()

,Anyo,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
346,2024,Total abortos voluntarios de mujeres residentes,Otros,NaN,NaN,18149,Número,NaN
347,2024,15 y 19 anos,Otros,NaN,NaN,1759,Número,NaN
348,2024,30 y 34 anos,Otros,NaN,NaN,3575,Número,NaN
349,2024,44 anos y mas,Otros,NaN,NaN,125,Número,NaN
350,2024,40 y 44 anos,Otros,NaN,NaN,1294,Número,NaN

In [315]:
t6 = limpiar_columnas(t6)
t6

     Anyo                                         Concepto  Valor
0    1986                                      20 y 24anos      -
1    1986                                    44 anos y mas      -
2    1986                                     40 y 44 anos      -
3    1986                               menores de 15 anos      -
4    1986  Total abortos voluntarios de mujeres residentes    148
..    ...                                              ...    ...
346  2024  Total abortos voluntarios de mujeres residentes  18149
347  2024                                     15 y 19 anos   1759
348  2024                                     30 y 34 anos   3575
349  2024                                    44 anos y mas    125
350  2024                                     40 y 44 anos   1294

[351 rows x 3 columns]

LImpiar de t7

In [316]:
t7.head(3)

,Año,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,1986,Abortos voluntarios de mujeres residentes por ...,Otros,NaN,NaN,1,Número,NaN
1,1986,Abortos voluntarios de mujeres residentes por ...,Otros,NaN,NaN,-,Número,NaN
2,1986,Abortos voluntarios de mujeres residentes por ...,Otros,NaN,NaN,-,Número,NaN

In [317]:
t7 = renombrar_columna(t7, "Año", "Anyo")
t7.head()

,Anyo,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,1986,Abortos voluntarios de mujeres residentes por ...,Otros,NaN,NaN,1,Número,NaN
1,1986,Abortos voluntarios de mujeres residentes por ...,Otros,NaN,NaN,-,Número,NaN
2,1986,Abortos voluntarios de mujeres residentes por ...,Otros,NaN,NaN,-,Número,NaN
3,1986,Abortos voluntarios de mujeres residentes por ...,Otros,NaN,NaN,137,Número,NaN
4,1986,Abortos voluntarios de mujeres residentes de a...,Otros,NaN,NaN,-,Número,NaN

In [318]:
t7 = limpiar_columnas(t7)
t7.head(3)

   Anyo                                           Concepto Valor
0  1986  Abortos voluntarios de mujeres residentes por ...     1
1  1986  Abortos voluntarios de mujeres residentes por ...     -
2  1986  Abortos voluntarios de mujeres residentes por ...     -

In [319]:
t7["Concepto"].unique()

array(['Abortos voluntarios de mujeres residentes por violación',
       'Abortos voluntarios de mujeres residentes por riesgo de graves anomalías del feto',
       'Abortos voluntarios de mujeres residentes por grave riesgo para la vida o salud de la embarazada',
       'Abortos voluntarios de mujeres residentes por salud materna',
       'Abortos voluntarios de mujeres residentes de anomalías fetales incompatibles con la vida o enfermedad extremadamente grave e incurable',
       'Abortos voluntarios de mujeres residentes de los que no constan los motivos',
       'Abortos voluntarios de mujeres residentes por motivos varios',
       'Abortos voluntarios de mujeres residentes a petición de la mujer',
       'Abortos voluntarios de mujeres residentes por riesgo fetal'],
      dtype=object)

In [320]:
t7 = limpiar_concepto_abortos(t7)
t7.head()

   Anyo                                           Concepto Valor
0  1986                                      por violación     1
1  1986            por riesgo de graves anomalías del feto     -
2  1986  por grave riesgo para la vida o salud de la em...     -
3  1986                                  por salud materna   137
4  1986  anomalías fetales incompatibles con la vida o ...     -

In [321]:
t7['Concepto'] = t7['Concepto'].apply(quitar_acentos)
t7.head()

   Anyo                                           Concepto Valor
0  1986                                      por violacion     1
1  1986            por riesgo de graves anomalias del feto     -
2  1986  por grave riesgo para la vida o salud de la em...     -
3  1986                                  por salud materna   137
4  1986  anomalias fetales incompatibles con la vida o ...     -

Limpiar dataset t8

In [322]:
t8.head(3)

,Año,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,-,Número,NaN
1,1986,Abortos voluntarios de mujeres residentes de l...,Otros,NaN,NaN,6,Número,NaN
2,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,1,Número,NaN

In [323]:
t8 = renombrar_columna(t8, "Año", "Anyo")
t8.head()

,Anyo,Concepto,Tipo territorio,Código territorio,Territorio,Valor,Unidad,Estado dato
0,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,-,Número,NaN
1,1986,Abortos voluntarios de mujeres residentes de l...,Otros,NaN,NaN,6,Número,NaN
2,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,1,Número,NaN
3,1986,Abortos voluntarios de mujeres residentes de 2...,Otros,NaN,NaN,-,Número,NaN
4,1986,Abortos voluntarios de mujeres residentes entr...,Otros,NaN,NaN,-,Número,NaN

In [324]:
t8 = limpiar_columnas(t8)
t8

     Anyo                                           Concepto  Valor
0    1986  Abortos voluntarios de mujeres residentes entr...      -
1    1986  Abortos voluntarios de mujeres residentes de l...      6
2    1986  Abortos voluntarios de mujeres residentes entr...      1
3    1986  Abortos voluntarios de mujeres residentes de 2...      -
4    1986  Abortos voluntarios de mujeres residentes entr...      -
..    ...                                                ...    ...
502  2024  Abortos voluntarios de mujeres residentes entr...      -
503  2024  Abortos voluntarios de mujeres residentes entr...      -
504  2024  Abortos voluntarios de mujeres residentes entr...      -
505  2024  Abortos voluntarios de mujeres residentes entr...      -
506  2024  Abortos voluntarios de mujeres residentes de 8...  13441

[507 rows x 3 columns]

In [325]:
t8 = limpiar_concepto_abortos(t8)
t8.head()

   Anyo                                    Concepto Valor
0  1986                13 y 16 semanas de gestación     -
1  1986  los que no consta las semanas de gestación     6
2  1986               21 semanas y más de gestación     1
3  1986               23 o más semanas de gestación     -
4  1986                15 y 22 semanas de gestación     -

In [326]:
t8['Concepto'] = t8['Concepto'].apply(quitar_acentos)
t8.head()

   Anyo                                    Concepto Valor
0  1986                13 y 16 semanas de gestacion     -
1  1986  los que no consta las semanas de gestacion     6
2  1986               21 semanas y mas de gestacion     1
3  1986               23 o mas semanas de gestacion     -
4  1986                15 y 22 semanas de gestacion     -

Ahora hacer el join con las diferentes tablas

In [327]:
t5["origen"] = "metodo"
t6["origen"] = "edad"
t7["origen"] = "motivo"
t8["origen"] = "gestacion"

In [328]:
"""t5_wide = t5.pivot_table(
    index="Anyo",
    columns="Concepto",
    values="Valor",
    aggfunc="sum"
).reset_index() """

't5_wide = t5.pivot_table(\n    index="Anyo",\n    columns="Concepto",\n    values="Valor",\n    aggfunc="sum"\n).reset_index() '

In [329]:
"""t6_wide = t6.pivot_table(
    index="Anyo",
    columns="Concepto",
    values="Valor",
    aggfunc="sum"
).reset_index()"""

't6_wide = t6.pivot_table(\n    index="Anyo",\n    columns="Concepto",\n    values="Valor",\n    aggfunc="sum"\n).reset_index()'

In [330]:
"""t7_wide = t7.pivot_table(
    index="Anyo",
    columns="Concepto",
    values="Valor",
    aggfunc="sum"
).reset_index()"""

't7_wide = t7.pivot_table(\n    index="Anyo",\n    columns="Concepto",\n    values="Valor",\n    aggfunc="sum"\n).reset_index()'

In [331]:
"""t8_wide = t8.pivot_table(
    index="Anyo",
    columns="Concepto",
    values="Valor",
    aggfunc="sum"
).reset_index()"""

't8_wide = t8.pivot_table(\n    index="Anyo",\n    columns="Concepto",\n    values="Valor",\n    aggfunc="sum"\n).reset_index()'

In [332]:
"""t5_wide["origen"] = "metodo"
t6_wide["origen"] = "edad"
t7_wide["origen"] = "motivo"
t8_wide["origen"] = "gestacion"

df_abortos = pd.concat([t5_wide, t6_wide, t7_wide, t8_wide], ignore_index=True)
df_abortos.tail()"""

't5_wide["origen"] = "metodo"\nt6_wide["origen"] = "edad"\nt7_wide["origen"] = "motivo"\nt8_wide["origen"] = "gestacion"\n\ndf_abortos = pd.concat([t5_wide, t6_wide, t7_wide, t8_wide], ignore_index=True)\ndf_abortos.tail()'

In [334]:
df_abortos = pd.concat([t5, t6, t7, t8], ignore_index=True)
df_abortos.tail()

      Anyo                        Concepto  Valor     origen
1274  2024    11 y 12 semanas de gestacion      -  gestacion
1275  2024     9 y 12 semanas de gestacion      -  gestacion
1276  2024    13 y 15 semanas de gestacion      -  gestacion
1277  2024    13 y 16 semanas de gestacion      -  gestacion
1278  2024  8 o menos semanas de gestacion  13441  gestacion